OpenDTEF-v1812/tutorials/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/0.orig/include/baffle3DSetup
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

baffleRegion    baffle3DRegion;

masterPatch     baffle3DRegionMaster;

slavePatch      baffle3DRegionSlave;

oneD            false;

nLayers         50;

thickness       0.02;

Kappa           0.01;

Cp              15;

rho             80;

// ************************************************************************* //
